ka2_2024/src/Documents/ПризнаниеРасходовПоИсследованиямИРазработкам/ПризнаниеРасходовПоИсследованиямИРазработкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПризнаниеРасходовПоИсследованиямИРазработкам</name>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.РасчетПризнанияРасходовНИОКР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТемыЭтапыИсследованийИРазработок</name>
    <attributes>
      <name>ТемаЭтап</name>
      <type>
        <types>CatalogRef.ТемыЭтапыИсследованийИРазработок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>ВидПризнанияРасходовБУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовБУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовБУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПризнанияРасходовНУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовНУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовНУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПризнанияРасходовУУ</name>
      <type>
        <types>EnumRef.ВидыПризнанияРасходовПоИсследованиямИРазработкам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовУУ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовУУ</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/InformationRegisters/УчетнаяПолитикаФинансовогоУчета/УчетнаяПолитикаФинансовогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаФинансовогоУчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодОценкиСтоимостиТоваров</name>
    <type>
      <types>EnumRef.МетодыОценкиСтоимостиТоваров</types>
    </type>
  </resources>
  <resources>
    <name>УчетГотовойПродукцииПоПлановойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПризнаватьРасходыПоИсследованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовПоИсследованиям</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовПоИсследованиям</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВыделениеДолгосрочныхАктивовОбязательств</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьОперационногоЦикла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНА</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНАРегл</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНАРегл</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОС</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОСРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАренда</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАрендаРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМА</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМАРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьМатериальныеИПостатейныеЗатратыВСебестоимостиТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетАрендыПоФСБУ25_2018</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МесяцНачалаФинансовогоГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПроводокПоОбесценениюВНА</name>
    <comment>Начислять амортизацию на полную (не обесцененную) стоимость и сторнировать корректировку обесценения (истина) или начислять амортизацию на обесцененную стоимость и доначислять корректировку обесценения (ложь) по IAS 36</comment>
    <type>
      <types>EnumRef.ВариантыПроводокПоОбесценениюВНА</types>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированнойКредиторскойЗадолженностиПоставщикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СрокДляПримененияДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированияРезервовПредстоящихРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОценкиЗадолженности</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВосстанавливатьРезервПриСписанииЗапасовНаРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Documents/ПризнаниеРасходовПоИсследованиямИРазработкам/Forms/РабочееМестоПризнанияРасходовПоИсследованиям/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПериодРегистрации", ПериодРегистрации);
	Параметры.Свойство("Организация", Организация);
	Если Организация.Пустая() Тогда
		МассивОрганизаций = Новый Массив();
		Параметры.Свойство("МассивОрганизаций", МассивОрганизаций);
		Если МассивОрганизаций.Количество() <> 0 Тогда
			Организация = МассивОрганизаций[0];
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеПериодаРегистрации = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);
	
	ОбновитьНастройкиУчетныхПолитик();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокИсследований();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОбработчикЗакрытия	= Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы		= Новый Структура("Значение, РежимВыбораПериода", ПериодРегистрации, "МЕСЯЦ");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода",
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,
		,
		, 
		ОбработчикЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(
		Направление,
		СтандартнаяОбработка,
		ПериодРегистрации,
		ПредставлениеПериодаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетнойПолитикиФинНажатие(Элемент)
		
	ОткрытьФорму("РегистрСведений.УчетнаяПолитикаФинансовогоУчета.ФормаЗаписи",
		Новый Структура("Организация", Организация),
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("НастройкиУчетнойПолитикиНажатиеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетнойПолитикиБухНажатие(Элемент)
	
	//++ Локализация
	ОткрытьФорму("РегистрСведений.УчетнаяПолитикаБухУчета.ФормаЗаписи",
		Новый Структура("Организация", Организация),
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("НастройкиУчетнойПолитикиНажатиеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//-- Локализация
		
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПриИзменении(Элемент)

	ОбновитьНастройкиУчетныхПолитик();
	ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере();
	ОбновитьНастройкиУчетныхПолитик();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокИсследованийКОтнесениюРасходов

&НаКлиенте
Процедура СписокИсследованийКОтнесениюРасходовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.СписокИсследованийКОтнесениюРасходовТемаЭтапИсследований Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.ТемаЭтапИсследований, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокИсследованийКОтнесениюРасходовДокументПризнания Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.ДокументПризнания, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокИсследованийКОтнесениюРасходовПодразделение Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.Подразделение, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовБУ Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.СтатьяРасходовБУ, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовБУ Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.АналитикаРасходовБУ, СтандартнаяОбработка);
	ИначеЕсли Поле = Элементы.СписокИсследованийКОтнесениюРасходовНаправлениеДеятельности Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОбъект(Элемент.ТекущиеДанные.НаправлениеДеятельности, СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокИсследованийКОтнесениюРасходов(Команда)
	
	ОбновитьСписокИсследований();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДокументПризнания(Команда)
	
	ОчиститьСообщения();

	СписокКОформлению = Элементы.СписокИсследованийКОтнесениюРасходов;
	ТекущаяСтрокаКОформлению = СписокКОформлению.ТекущиеДанные;

	Если ТекущаяСтрокаКОформлению = Неопределено Тогда
		ТекстПредупреждения = НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	ИсследованияКПризнанию = Новый Массив();

	Для Каждого ТекущаяСтрокаКОформлению Из СписокКОформлению.ВыделенныеСтроки Цикл

		ТекущиеДанныеПоСтроке = СписокКОформлению.ДанныеСтроки(ТекущаяСтрокаКОформлению);

		Если ТекущиеДанныеПоСтроке.ДокументПризнания.Пустая() Тогда
			ИсследованияКПризнанию.Добавить(ТекущиеДанныеПоСтроке.ТемаЭтапИсследований);
		Иначе
			ТекстСообщения = НСтр("ru = 'Для %1 уже введен документ завершения. Элемент не может быть включен в состав нового документа'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(ТекстСообщения, ТекущиеДанныеПоСтроке.ТемаЭтапИсследований),,
				"СписокИсследованийКОтнесениюРасходов[" + СписокИсследованийКОтнесениюРасходов.Индекс(ТекущаяСтрокаКОформлению) + "].ТемаЭтапИсследований");
		КонецЕсли;

	КонецЦикла;

	Если ИсследованияКПризнанию.Количество() > 0 Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ТемыЭтапы", ИсследованияКПризнанию);
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПризнаниеРасходовПоИсследованиям"));

		ОткрытьФорму("Документ.ПризнаниеРасходовПоИсследованиямИРазработкам.Форма.ФормаДокумента", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), , Истина, , , Новый ОписаниеОповещения("СформироватьДокументПризнанияЗавершение", ЭтотОбъект));
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Команда не может быть выполнена, так как нет доступных тем к признанию.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ДлительныеОперации

&НаКлиенте
Процедура ОбновитьСписокИсследований()

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяСобытия", "ОбновитьСписокИсследований");
		
	ДлительнаяОперация = ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере();
	
	ОтображениеСостоянияДлительнойОперации(ЭтаФорма, Истина);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОбновленияСпискаИсследований", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере()

	СписокИсследованийКОтнесениюРасходов.Очистить();

	Если ЗначениеЗаполнено(Организация) Тогда

		ПараметрыЗаполнения = Документы.ПризнаниеРасходовПоИсследованиямИРазработкам.ПараметрыЗаполнения();
		ПараметрыЗаполнения.НачалоПериода = ПериодРегистрации;
		ПараметрыЗаполнения.КонецПериода = КонецМесяца(ПериодРегистрации);
		ПараметрыЗаполнения.Организация = Организация;
		ПараметрыЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПризнаниеРасходовПоИсследованиям;
		ПараметрыЗаполнения.ВыполнятьПризнаниеБУ = ВыполнятьПризнаниеБУ;
		ПараметрыЗаполнения.ВыполнятьПризнаниеУУ = ВыполнятьПризнаниеУУ;
	
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление списка тем и этапов к завершению'");
		
		РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
			"Документы.ПризнаниеРасходовПоИсследованиямИРазработкам.ТемыЭтапыКОтнесениюРасходов",
			ПараметрыЗаполнения, ПараметрыВыполнения);
		
		Возврат РезультатВыполнения;
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПослеОбновленияСпискаИсследований(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ОтображениеСостоянияДлительнойОперации(ЭтаФорма, Ложь);
		ТекстСообщения = НСтр("ru = 'Произошла ошибка обновления списка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата, ДополнительныеПараметры);
	ОтображениеСостоянияДлительнойОперации(ЭтаФорма, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(АдресРезультата, ДополнительныеПараметры)
	
	Данные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого Строка Из Данные Цикл
		СтрокаТаблицы = СписокИсследованийКОтнесениюРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтображениеСостоянияДлительнойОперации(Форма, ВыполнениеОперации)
	
	Элементы = Форма.Элементы;

	Элементы.ГруппаОтборы.Доступность = НЕ ВыполнениеОперации;
	Элементы.ГруппаВыполнениеРасчетаВФоне.Видимость = ВыполнениеОперации;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		
		ПериодРегистрации = ВыбранныйПериод;
		ПредставлениеПериодаРегистрации =
			ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);
		
	КонецЕсли;
	
	ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере();
	ОбновитьНастройкиУчетныхПолитик();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Ссылка, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПоказатьЗначение(Неопределено, Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	//Условное оформление полей "по настройкам учетной политики"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовУУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовБУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовБУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовУУ.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ПоПараметрамУП";

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по настройкам учетной политики>'"));
	
	//Условное оформление полей "по текущему значению"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовПодразделение.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовНаправлениеДеятельности.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ПоПараметрамУП";

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по текущему значению>'"));
	
	//Условное оформление полей "по распределению"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовБУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовБУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовПодразделение.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовНаправлениеДеятельности.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовУУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовУУ.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "ПоДокументу";

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по распределению>'"));
	
	//Условное оформление подразделения "по текущему значению"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовПодразделение.Имя);
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУсловногоОформления.Отбор.Элементы,
		"ПоСтрокеПодразделение",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения",
		ВидСравненияКомпоновкиДанных.Равно,
		"ПоСтрокеДокумента");
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.Подразделение",
		ВидСравненияКомпоновкиДанных.Равно,
		Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по текущему значению>'"));
	
	//Условное оформление направления деятельности "по текущему значению"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовНаправлениеДеятельности.Имя);
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУсловногоОформления.Отбор.Элементы,
		"ПоСтрокеНаправлениеДеятельности",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения",
		ВидСравненияКомпоновкиДанных.Равно,
		"ПоСтрокеДокумента");
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.НаправлениеДеятельности",
		ВидСравненияКомпоновкиДанных.Равно,
		Справочники.НаправленияДеятельности.ПустаяСсылка());
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по текущему значению>'"));
	
	//Условное оформление полей БУ "не выполняется признание"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовБУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовБУ.Имя);
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУсловногоОформления.Отбор.Элементы,
		"ПоСтрокеДокументаБУ",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения",
		ВидСравненияКомпоновкиДанных.Равно,
		"ПоСтрокеДокумента");
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ВидПризнанияРасходовБУ",
		ВидСравненияКомпоновкиДанных.Равно,
		Перечисления.ВидыПризнанияРасходовПоИсследованиямИРазработкам.НеВыполнятьПризнаниеРасходов);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не выполняется признание>'"));
	
	//Условное оформление полей УУ "не выполняется признание"
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовУУ.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовУУ.Имя);
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУсловногоОформления.Отбор.Элементы,
		"ПоСтрокеДокументаУУ",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения",
		ВидСравненияКомпоновкиДанных.Равно,
		"ПоСтрокеДокумента");
	ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"СписокИсследованийКОтнесениюРасходов.ВидПризнанияРасходовУУ",
		ВидСравненияКомпоновкиДанных.Равно,
		Перечисления.ВидыПризнанияРасходовПоИсследованиямИРазработкам.НеВыполнятьПризнаниеРасходов);
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не выполняется признание>'"));
	
	//Условное оформление полей УУ "совпадает с бухгалтерским учетом"
	Если ВыполнятьПризнаниеБУ = Истина Тогда
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовСтатьяРасходовУУ.Имя);
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокИсследованийКОтнесениюРасходовАналитикаРасходовУУ.Имя);
		
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУсловногоОформления.Отбор.Элементы,
			"ПоСтрокеДокументаУУ",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"СписокИсследованийКОтнесениюРасходов.ПараметрОтображенияРаспределения",
			ВидСравненияКомпоновкиДанных.Равно,
			"ПоСтрокеДокумента");
		ОтборЭлемента = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"СписокИсследованийКОтнесениюРасходов.ВидПризнанияРасходовУУ",
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<совпадает с бухгалтерским учетом>'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументПризнанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетнойПолитикиНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьНастройкиУчетныхПолитик();

КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиУчетныхПолитик()

	Организации = Новый Массив();
	Организации.Добавить(Организация);
	
	НастройкиПризнанияИсследований = УчетРасходовПоИсследованиямИРазработкам.НастройкиПризнанияРасходовПоИсследованиямОрганизаций(
		ПериодРегистрации,
		Организации);

	НастройкиУчетнойПолитикиБух = НастройкиПризнанияИсследований.Найти("БухУчет","УчетнаяПолитика");
	Если НастройкиУчетнойПолитикиБух <> Неопределено Тогда
		Элементы.НастройкиУчетнойПолитикиБух.Заголовок = Строка(НастройкиУчетнойПолитикиБух.СтатьяРасходов)
			+ ?(ЗначениеЗаполнено(НастройкиУчетнойПолитикиБух.АналитикаРасходов),", "+ НастройкиУчетнойПолитикиБух.АналитикаРасходов,"");
		Если Элементы.НастройкиУчетнойПолитикиБух.Заголовок = "" Тогда
			Элементы.НастройкиУчетнойПолитикиБух.Заголовок = НСтр("ru = '<Не заданы настройки>'");
		КонецЕсли;
		Элементы.ГруппаНастройкиУчетнойПолитикиБух.Видимость = Истина;
		Элементы.СписокИсследованийКОтнесениюРасходовГруппаБУ.Видимость = Истина;
		ВыполнятьПризнаниеБУ = Истина;
	Иначе
		Элементы.ГруппаНастройкиУчетнойПолитикиБух.Видимость = Ложь;
		Элементы.СписокИсследованийКОтнесениюРасходовГруппаБУ.Видимость = Ложь;
		ВыполнятьПризнаниеБУ = Ложь;
	КонецЕсли;
	
	НастройкиУчетнойПолитикиФин = НастройкиПризнанияИсследований.Найти("ФинУчет","УчетнаяПолитика");
	Если НастройкиУчетнойПолитикиФин <> Неопределено Тогда
		Элементы.НастройкиУчетнойПолитикиФин.Заголовок = Строка(НастройкиУчетнойПолитикиФин.СтатьяРасходов)
			+ ?(ЗначениеЗаполнено(НастройкиУчетнойПолитикиФин.АналитикаРасходов),", "+ НастройкиУчетнойПолитикиФин.АналитикаРасходов,"");
		Если Элементы.НастройкиУчетнойПолитикиБух.Заголовок = "" Тогда
			Элементы.НастройкиУчетнойПолитикиБух.Заголовок = НСтр("ru = '<Не заданы настройки>'");
		КонецЕсли;
		Элементы.ГруппаНастройкиУчетнойПолитикиФин.Видимость = Истина;
		Элементы.СписокИсследованийКОтнесениюРасходовГруппаУУ.Видимость = Истина;
		ВыполнятьПризнаниеУУ = Истина;
	Иначе
		Элементы.ГруппаНастройкиУчетнойПолитикиФин.Видимость = Ложь;
		Элементы.СписокИсследованийКОтнесениюРасходовГруппаУУ.Видимость = Ложь;
		ВыполнятьПризнаниеУУ = Ложь;
	КонецЕсли;
	
	ОбновитьСписокИсследованийКОтнесениюРасходовНаСервере();
	
КонецПроцедуры

#КонецОбласти
